tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Text processing scripting language
brew "awk"
# Pack, ship and run any application as a lightweight container
brew "docker"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext", link: true
# Command-line utility for uploading Gists
brew "gist"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Like cURL, but for gRPC
brew "grpcurl"
# Idempotent command-line utility for managing your /etc/hosts file
brew "hostess"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Mac App Store command-line interface
brew "mas"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Shell command parallelization utility
brew "parallel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Code-search similar to ack
brew "the_silver_searcher"
# Programatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
cask "alacritty"
cask "basictex"
cask "vagrant"
cask "virtualbox"
mas "1Password", id: 443987910
mas "1Password 7", id: 1333542190
mas "Fantastical", id: 975937182
mas "Keynote", id: 409183694
mas "LittleIpsum", id: 405772121
mas "Magnet", id: 441258766
mas "Mouseposé", id: 405904955
mas "PCalc", id: 403504866
mas "Pixelmator", id: 407963104
mas "Shush", id: 496437906
mas "Slack", id: 803453959
mas "Soulver", id: 413965349
mas "TaskPaper", id: 1090940630
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "xScope", id: 889428659
